zephyrproject-rtos/hal_silabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32BG29/Include/efr32bg29_dcdc.h
/**************************************************************************//**
 * @file
 * @brief EFR32BG29 DCDC register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2026 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32BG29_DCDC_H
#define EFR32BG29_DCDC_H
#define DCDC_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32BG29_DCDC DCDC
 * @{
 * @brief EFR32BG29 DCDC Register Declaration.
 *****************************************************************************/

/** DCDC Register Declaration. */
typedef struct dcdc_typedef{
  __IM uint32_t  IPVERSION;                     /**< IPVERSION                                          */
  __IOM uint32_t CTRL;                          /**< Control                                            */
  uint32_t       RESERVED0[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t EM01CTRL0;                     /**< EM01 Control                                       */
  __IOM uint32_t EM23CTRL0;                     /**< EM23 Control                                       */
  uint32_t       RESERVED1[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t BSTCTRL;                       /**< Boost Control Register                             */
  uint32_t       RESERVED2[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t BSTEM01CTRL;                   /**< EM01 Boost Control                                 */
  __IOM uint32_t BSTEM23CTRL;                   /**< EM23 Boost Control                                 */
  uint32_t       RESERVED3[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t IF;                            /**< Interrupt Flags                                    */
  __IOM uint32_t IEN;                           /**< Interrupt Enable                                   */
  __IM uint32_t  STATUS;                        /**< Status Register                                    */
  __IM uint32_t  SYNCBUSY;                      /**< Syncbusy Status Register                           */
  uint32_t       RESERVED4[7U];                 /**< Reserved for future use                            */
  __IOM uint32_t CCCTRL;                        /**< Coulomb Counter Control                            */
  __IOM uint32_t CCCALCTRL;                     /**< Coulomb Counter Calibration Control                */
  __IOM uint32_t CCCMD;                         /**< Coulomb Counter Command                            */
  __IM uint32_t  CCEM0CNT;                      /**< Coulomb Counter EM0 Count Value                    */
  __IM uint32_t  CCEM2CNT;                      /**< Coulomb Counter EM2 Count Value                    */
  __IOM uint32_t CCTHR;                         /**< Coulomb Counter Threshold                          */
  __IOM uint32_t CCIF;                          /**< Coulomb Counter Interrupt Flag                     */
  __IOM uint32_t CCIEN;                         /**< Coulomb Counter Interrupt Enable                   */
  __IM uint32_t  CCSTATUS;                      /**< Coulomb Counter Status                             */
  uint32_t       RESERVED5[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t LOCK;                          /**< Lock Register                                      */
  __IM uint32_t  LOCKSTATUS;                    /**< Lock Status Register                               */
  uint32_t       RESERVED6[2U];                 /**< Reserved for future use                            */
  uint32_t       RESERVED7[1U];                 /**< Reserved for future use                            */
  uint32_t       RESERVED8[7U];                 /**< Reserved for future use                            */
  uint32_t       RESERVED9[1U];                 /**< Reserved for future use                            */
  uint32_t       RESERVED10[7U];                /**< Reserved for future use                            */
  uint32_t       RESERVED11[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED12[967U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_SET;                 /**< IPVERSION                                          */
  __IOM uint32_t CTRL_SET;                      /**< Control                                            */
  uint32_t       RESERVED13[1U];                /**< Reserved for future use                            */
  __IOM uint32_t EM01CTRL0_SET;                 /**< EM01 Control                                       */
  __IOM uint32_t EM23CTRL0_SET;                 /**< EM23 Control                                       */
  uint32_t       RESERVED14[3U];                /**< Reserved for future use                            */
  __IOM uint32_t BSTCTRL_SET;                   /**< Boost Control Register                             */
  uint32_t       RESERVED15[1U];                /**< Reserved for future use                            */
  __IOM uint32_t BSTEM01CTRL_SET;               /**< EM01 Boost Control                                 */
  __IOM uint32_t BSTEM23CTRL_SET;               /**< EM23 Boost Control                                 */
  uint32_t       RESERVED16[1U];                /**< Reserved for future use                            */
  __IOM uint32_t IF_SET;                        /**< Interrupt Flags                                    */
  __IOM uint32_t IEN_SET;                       /**< Interrupt Enable                                   */
  __IM uint32_t  STATUS_SET;                    /**< Status Register                                    */
  __IM uint32_t  SYNCBUSY_SET;                  /**< Syncbusy Status Register                           */
  uint32_t       RESERVED17[7U];                /**< Reserved for future use                            */
  __IOM uint32_t CCCTRL_SET;                    /**< Coulomb Counter Control                            */
  __IOM uint32_t CCCALCTRL_SET;                 /**< Coulomb Counter Calibration Control                */
  __IOM uint32_t CCCMD_SET;                     /**< Coulomb Counter Command                            */
  __IM uint32_t  CCEM0CNT_SET;                  /**< Coulomb Counter EM0 Count Value                    */
  __IM uint32_t  CCEM2CNT_SET;                  /**< Coulomb Counter EM2 Count Value                    */
  __IOM uint32_t CCTHR_SET;                     /**< Coulomb Counter Threshold                          */
  __IOM uint32_t CCIF_SET;                      /**< Coulomb Counter Interrupt Flag                     */
  __IOM uint32_t CCIEN_SET;                     /**< Coulomb Counter Interrupt Enable                   */
  __IM uint32_t  CCSTATUS_SET;                  /**< Coulomb Counter Status                             */
  uint32_t       RESERVED18[3U];                /**< Reserved for future use                            */
  __IOM uint32_t LOCK_SET;                      /**< Lock Register                                      */
  __IM uint32_t  LOCKSTATUS_SET;                /**< Lock Status Register                               */
  uint32_t       RESERVED19[2U];                /**< Reserved for future use                            */
  uint32_t       RESERVED20[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED21[7U];                /**< Reserved for future use                            */
  uint32_t       RESERVED22[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED23[7U];                /**< Reserved for future use                            */
  uint32_t       RESERVED24[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED25[967U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_CLR;                 /**< IPVERSION                                          */
  __IOM uint32_t CTRL_CLR;                      /**< Control                                            */
  uint32_t       RESERVED26[1U];                /**< Reserved for future use                            */
  __IOM uint32_t EM01CTRL0_CLR;                 /**< EM01 Control                                       */
  __IOM uint32_t EM23CTRL0_CLR;                 /**< EM23 Control                                       */
  uint32_t       RESERVED27[3U];                /**< Reserved for future use                            */
  __IOM uint32_t BSTCTRL_CLR;                   /**< Boost Control Register                             */
  uint32_t       RESERVED28[1U];                /**< Reserved for future use                            */
  __IOM uint32_t BSTEM01CTRL_CLR;               /**< EM01 Boost Control                                 */
  __IOM uint32_t BSTEM23CTRL_CLR;               /**< EM23 Boost Control                                 */
  uint32_t       RESERVED29[1U];                /**< Reserved for future use                            */
  __IOM uint32_t IF_CLR;                        /**< Interrupt Flags                                    */
  __IOM uint32_t IEN_CLR;                       /**< Interrupt Enable                                   */
  __IM uint32_t  STATUS_CLR;                    /**< Status Register                                    */
  __IM uint32_t  SYNCBUSY_CLR;                  /**< Syncbusy Status Register                           */
  uint32_t       RESERVED30[7U];                /**< Reserved for future use                            */
  __IOM uint32_t CCCTRL_CLR;                    /**< Coulomb Counter Control                            */
  __IOM uint32_t CCCALCTRL_CLR;                 /**< Coulomb Counter Calibration Control                */
  __IOM uint32_t CCCMD_CLR;                     /**< Coulomb Counter Command                            */
  __IM uint32_t  CCEM0CNT_CLR;                  /**< Coulomb Counter EM0 Count Value                    */
  __IM uint32_t  CCEM2CNT_CLR;                  /**< Coulomb Counter EM2 Count Value                    */
  __IOM uint32_t CCTHR_CLR;                     /**< Coulomb Counter Threshold                          */
  __IOM uint32_t CCIF_CLR;                      /**< Coulomb Counter Interrupt Flag                     */
  __IOM uint32_t CCIEN_CLR;                     /**< Coulomb Counter Interrupt Enable                   */
  __IM uint32_t  CCSTATUS_CLR;                  /**< Coulomb Counter Status                             */
  uint32_t       RESERVED31[3U];                /**< Reserved for future use                            */
  __IOM uint32_t LOCK_CLR;                      /**< Lock Register                                      */
  __IM uint32_t  LOCKSTATUS_CLR;                /**< Lock Status Register                               */
  uint32_t       RESERVED32[2U];                /**< Reserved for future use                            */
  uint32_t       RESERVED33[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED34[7U];                /**< Reserved for future use                            */
  uint32_t       RESERVED35[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED36[7U];                /**< Reserved for future use                            */
  uint32_t       RESERVED37[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED38[967U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_TGL;                 /**< IPVERSION                                          */
  __IOM uint32_t CTRL_TGL;                      /**< Control                                            */
  uint32_t       RESERVED39[1U];                /**< Reserved for future use                            */
  __IOM uint32_t EM01CTRL0_TGL;                 /**< EM01 Control                                       */
  __IOM uint32_t EM23CTRL0_TGL;                 /**< EM23 Control                                       */
  uint32_t       RESERVED40[3U];                /**< Reserved for future use                            */
  __IOM uint32_t BSTCTRL_TGL;                   /**< Boost Control Register                             */
  uint32_t       RESERVED41[1U];                /**< Reserved for future use                            */
  __IOM uint32_t BSTEM01CTRL_TGL;               /**< EM01 Boost Control                                 */
  __IOM uint32_t BSTEM23CTRL_TGL;               /**< EM23 Boost Control                                 */
  uint32_t       RESERVED42[1U];                /**< Reserved for future use                            */
  __IOM uint32_t IF_TGL;                        /**< Interrupt Flags                                    */
  __IOM uint32_t IEN_TGL;                       /**< Interrupt Enable                                   */
  __IM uint32_t  STATUS_TGL;                    /**< Status Register                                    */
  __IM uint32_t  SYNCBUSY_TGL;                  /**< Syncbusy Status Register                           */
  uint32_t       RESERVED43[7U];                /**< Reserved for future use                            */
  __IOM uint32_t CCCTRL_TGL;                    /**< Coulomb Counter Control                            */
  __IOM uint32_t CCCALCTRL_TGL;                 /**< Coulomb Counter Calibration Control                */
  __IOM uint32_t CCCMD_TGL;                     /**< Coulomb Counter Command                            */
  __IM uint32_t  CCEM0CNT_TGL;                  /**< Coulomb Counter EM0 Count Value                    */
  __IM uint32_t  CCEM2CNT_TGL;                  /**< Coulomb Counter EM2 Count Value                    */
  __IOM uint32_t CCTHR_TGL;                     /**< Coulomb Counter Threshold                          */
  __IOM uint32_t CCIF_TGL;                      /**< Coulomb Counter Interrupt Flag                     */
  __IOM uint32_t CCIEN_TGL;                     /**< Coulomb Counter Interrupt Enable                   */
  __IM uint32_t  CCSTATUS_TGL;                  /**< Coulomb Counter Status                             */
  uint32_t       RESERVED44[3U];                /**< Reserved for future use                            */
  __IOM uint32_t LOCK_TGL;                      /**< Lock Register                                      */
  __IM uint32_t  LOCKSTATUS_TGL;                /**< Lock Status Register                               */
  uint32_t       RESERVED45[2U];                /**< Reserved for future use                            */
  uint32_t       RESERVED46[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED47[7U];                /**< Reserved for future use                            */
  uint32_t       RESERVED48[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED49[7U];                /**< Reserved for future use                            */
  uint32_t       RESERVED50[1U];                /**< Reserved for future use                            */
} DCDC_TypeDef;
/** @} End of group EFR32BG29_DCDC */

/**************************************************************************//**
 * @addtogroup EFR32BG29_DCDC
 * @{
 * @defgroup EFR32BG29_DCDC_BitFields DCDC Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for DCDC IPVERSION */
#define _DCDC_IPVERSION_RESETVALUE                    0x00000006UL                             /**< Default value for DCDC_IPVERSION            */
#define _DCDC_IPVERSION_MASK                          0xFFFFFFFFUL                             /**< Mask for DCDC_IPVERSION                     */
#define _DCDC_IPVERSION_IPVERSION_SHIFT               0                                        /**< Shift value for DCDC_IPVERSION              */
#define _DCDC_IPVERSION_IPVERSION_MASK                0xFFFFFFFFUL                             /**< Bit mask for DCDC_IPVERSION                 */
#define _DCDC_IPVERSION_IPVERSION_DEFAULT             0x00000006UL                             /**< Mode DEFAULT for DCDC_IPVERSION             */
#define DCDC_IPVERSION_IPVERSION_DEFAULT              (_DCDC_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for DCDC_IPVERSION     */

