zephyrproject-rtos/hal_silabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32BG29/Include/efr32bg29_dcdc.h
/* Bit fields for DCDC IF */
#define _DCDC_IF_RESETVALUE                           0x00000000UL                       /**< Default value for DCDC_IF                   */
#define _DCDC_IF_MASK                                 0x000000FFUL                       /**< Mask for DCDC_IF                            */
#define DCDC_IF_BYPSW                                 (0x1UL << 0)                       /**< Bypass Switch Enabled                       */
#define _DCDC_IF_BYPSW_SHIFT                          0                                  /**< Shift value for DCDC_BYPSW                  */
#define _DCDC_IF_BYPSW_MASK                           0x1UL                              /**< Bit mask for DCDC_BYPSW                     */
#define _DCDC_IF_BYPSW_DEFAULT                        0x00000000UL                       /**< Mode DEFAULT for DCDC_IF                    */
#define DCDC_IF_BYPSW_DEFAULT                         (_DCDC_IF_BYPSW_DEFAULT << 0)      /**< Shifted mode DEFAULT for DCDC_IF            */
#define DCDC_IF_WARM                                  (0x1UL << 1)                       /**< DCDC Warmup Time Done                       */
#define _DCDC_IF_WARM_SHIFT                           1                                  /**< Shift value for DCDC_WARM                   */
#define _DCDC_IF_WARM_MASK                            0x2UL                              /**< Bit mask for DCDC_WARM                      */
#define _DCDC_IF_WARM_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for DCDC_IF                    */
#define DCDC_IF_WARM_DEFAULT                          (_DCDC_IF_WARM_DEFAULT << 1)       /**< Shifted mode DEFAULT for DCDC_IF            */
#define DCDC_IF_RUNNING                               (0x1UL << 2)                       /**< DCDC Running                                */
#define _DCDC_IF_RUNNING_SHIFT                        2                                  /**< Shift value for DCDC_RUNNING                */
#define _DCDC_IF_RUNNING_MASK                         0x4UL                              /**< Bit mask for DCDC_RUNNING                   */
#define _DCDC_IF_RUNNING_DEFAULT                      0x00000000UL                       /**< Mode DEFAULT for DCDC_IF                    */
#define DCDC_IF_RUNNING_DEFAULT                       (_DCDC_IF_RUNNING_DEFAULT << 2)    /**< Shifted mode DEFAULT for DCDC_IF            */
#define DCDC_IF_VREGINLOW                             (0x1UL << 3)                       /**< VREGVDD below threshold                     */
#define _DCDC_IF_VREGINLOW_SHIFT                      3                                  /**< Shift value for DCDC_VREGINLOW              */
#define _DCDC_IF_VREGINLOW_MASK                       0x8UL                              /**< Bit mask for DCDC_VREGINLOW                 */
#define _DCDC_IF_VREGINLOW_DEFAULT                    0x00000000UL                       /**< Mode DEFAULT for DCDC_IF                    */
#define DCDC_IF_VREGINLOW_DEFAULT                     (_DCDC_IF_VREGINLOW_DEFAULT << 3)  /**< Shifted mode DEFAULT for DCDC_IF            */
#define DCDC_IF_VREGINHIGH                            (0x1UL << 4)                       /**< VREGVDD above threshold                     */
#define _DCDC_IF_VREGINHIGH_SHIFT                     4                                  /**< Shift value for DCDC_VREGINHIGH             */
#define _DCDC_IF_VREGINHIGH_MASK                      0x10UL                             /**< Bit mask for DCDC_VREGINHIGH                */
#define _DCDC_IF_VREGINHIGH_DEFAULT                   0x00000000UL                       /**< Mode DEFAULT for DCDC_IF                    */
#define DCDC_IF_VREGINHIGH_DEFAULT                    (_DCDC_IF_VREGINHIGH_DEFAULT << 4) /**< Shifted mode DEFAULT for DCDC_IF            */
#define DCDC_IF_REGULATION                            (0x1UL << 5)                       /**< DCDC in regulation                          */
#define _DCDC_IF_REGULATION_SHIFT                     5                                  /**< Shift value for DCDC_REGULATION             */
#define _DCDC_IF_REGULATION_MASK                      0x20UL                             /**< Bit mask for DCDC_REGULATION                */
#define _DCDC_IF_REGULATION_DEFAULT                   0x00000000UL                       /**< Mode DEFAULT for DCDC_IF                    */
#define DCDC_IF_REGULATION_DEFAULT                    (_DCDC_IF_REGULATION_DEFAULT << 5) /**< Shifted mode DEFAULT for DCDC_IF            */
#define DCDC_IF_TMAX                                  (0x1UL << 6)                       /**< Buck Max Ton/Boost Max Toff reached         */
#define _DCDC_IF_TMAX_SHIFT                           6                                  /**< Shift value for DCDC_TMAX                   */
#define _DCDC_IF_TMAX_MASK                            0x40UL                             /**< Bit mask for DCDC_TMAX                      */
#define _DCDC_IF_TMAX_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for DCDC_IF                    */
#define DCDC_IF_TMAX_DEFAULT                          (_DCDC_IF_TMAX_DEFAULT << 6)       /**< Shifted mode DEFAULT for DCDC_IF            */
#define DCDC_IF_EM4ERR                                (0x1UL << 7)                       /**< EM4 Entry Request Error                     */
#define _DCDC_IF_EM4ERR_SHIFT                         7                                  /**< Shift value for DCDC_EM4ERR                 */
#define _DCDC_IF_EM4ERR_MASK                          0x80UL                             /**< Bit mask for DCDC_EM4ERR                    */
#define _DCDC_IF_EM4ERR_DEFAULT                       0x00000000UL                       /**< Mode DEFAULT for DCDC_IF                    */
#define DCDC_IF_EM4ERR_DEFAULT                        (_DCDC_IF_EM4ERR_DEFAULT << 7)     /**< Shifted mode DEFAULT for DCDC_IF            */

/* Bit fields for DCDC IEN */
#define _DCDC_IEN_RESETVALUE                          0x00000000UL                        /**< Default value for DCDC_IEN                  */
#define _DCDC_IEN_MASK                                0x000000FFUL                        /**< Mask for DCDC_IEN                           */
#define DCDC_IEN_BYPSW                                (0x1UL << 0)                        /**< Bypass Switch Enabled Interrupt Enable      */
#define _DCDC_IEN_BYPSW_SHIFT                         0                                   /**< Shift value for DCDC_BYPSW                  */
#define _DCDC_IEN_BYPSW_MASK                          0x1UL                               /**< Bit mask for DCDC_BYPSW                     */
#define _DCDC_IEN_BYPSW_DEFAULT                       0x00000000UL                        /**< Mode DEFAULT for DCDC_IEN                   */
#define DCDC_IEN_BYPSW_DEFAULT                        (_DCDC_IEN_BYPSW_DEFAULT << 0)      /**< Shifted mode DEFAULT for DCDC_IEN           */
#define DCDC_IEN_WARM                                 (0x1UL << 1)                        /**< DCDC Warmup Time Done Interrupt Enable      */
#define _DCDC_IEN_WARM_SHIFT                          1                                   /**< Shift value for DCDC_WARM                   */
#define _DCDC_IEN_WARM_MASK                           0x2UL                               /**< Bit mask for DCDC_WARM                      */
#define _DCDC_IEN_WARM_DEFAULT                        0x00000000UL                        /**< Mode DEFAULT for DCDC_IEN                   */
#define DCDC_IEN_WARM_DEFAULT                         (_DCDC_IEN_WARM_DEFAULT << 1)       /**< Shifted mode DEFAULT for DCDC_IEN           */
#define DCDC_IEN_RUNNING                              (0x1UL << 2)                        /**< DCDC Running Interrupt Enable               */
#define _DCDC_IEN_RUNNING_SHIFT                       2                                   /**< Shift value for DCDC_RUNNING                */
#define _DCDC_IEN_RUNNING_MASK                        0x4UL                               /**< Bit mask for DCDC_RUNNING                   */
#define _DCDC_IEN_RUNNING_DEFAULT                     0x00000000UL                        /**< Mode DEFAULT for DCDC_IEN                   */
#define DCDC_IEN_RUNNING_DEFAULT                      (_DCDC_IEN_RUNNING_DEFAULT << 2)    /**< Shifted mode DEFAULT for DCDC_IEN           */
#define DCDC_IEN_VREGINLOW                            (0x1UL << 3)                        /**< VREGVDD below threshold Interrupt Enable    */
#define _DCDC_IEN_VREGINLOW_SHIFT                     3                                   /**< Shift value for DCDC_VREGINLOW              */
#define _DCDC_IEN_VREGINLOW_MASK                      0x8UL                               /**< Bit mask for DCDC_VREGINLOW                 */
#define _DCDC_IEN_VREGINLOW_DEFAULT                   0x00000000UL                        /**< Mode DEFAULT for DCDC_IEN                   */
#define DCDC_IEN_VREGINLOW_DEFAULT                    (_DCDC_IEN_VREGINLOW_DEFAULT << 3)  /**< Shifted mode DEFAULT for DCDC_IEN           */
#define DCDC_IEN_VREGINHIGH                           (0x1UL << 4)                        /**< VREGVDD above threshold Interrupt Enable    */
#define _DCDC_IEN_VREGINHIGH_SHIFT                    4                                   /**< Shift value for DCDC_VREGINHIGH             */
#define _DCDC_IEN_VREGINHIGH_MASK                     0x10UL                              /**< Bit mask for DCDC_VREGINHIGH                */
#define _DCDC_IEN_VREGINHIGH_DEFAULT                  0x00000000UL                        /**< Mode DEFAULT for DCDC_IEN                   */
#define DCDC_IEN_VREGINHIGH_DEFAULT                   (_DCDC_IEN_VREGINHIGH_DEFAULT << 4) /**< Shifted mode DEFAULT for DCDC_IEN           */
#define DCDC_IEN_REGULATION                           (0x1UL << 5)                        /**< DCDC in Regulation Interrupt Enable         */
#define _DCDC_IEN_REGULATION_SHIFT                    5                                   /**< Shift value for DCDC_REGULATION             */
#define _DCDC_IEN_REGULATION_MASK                     0x20UL                              /**< Bit mask for DCDC_REGULATION                */
#define _DCDC_IEN_REGULATION_DEFAULT                  0x00000000UL                        /**< Mode DEFAULT for DCDC_IEN                   */
#define DCDC_IEN_REGULATION_DEFAULT                   (_DCDC_IEN_REGULATION_DEFAULT << 5) /**< Shifted mode DEFAULT for DCDC_IEN           */
#define DCDC_IEN_TMAX                                 (0x1UL << 6)                        /**< Ton_max Timeout Interrupt Enable            */
#define _DCDC_IEN_TMAX_SHIFT                          6                                   /**< Shift value for DCDC_TMAX                   */
#define _DCDC_IEN_TMAX_MASK                           0x40UL                              /**< Bit mask for DCDC_TMAX                      */
#define _DCDC_IEN_TMAX_DEFAULT                        0x00000000UL                        /**< Mode DEFAULT for DCDC_IEN                   */
#define DCDC_IEN_TMAX_DEFAULT                         (_DCDC_IEN_TMAX_DEFAULT << 6)       /**< Shifted mode DEFAULT for DCDC_IEN           */
#define DCDC_IEN_EM4ERR                               (0x1UL << 7)                        /**< EM4 Entry Req Interrupt Enable              */
#define _DCDC_IEN_EM4ERR_SHIFT                        7                                   /**< Shift value for DCDC_EM4ERR                 */
#define _DCDC_IEN_EM4ERR_MASK                         0x80UL                              /**< Bit mask for DCDC_EM4ERR                    */
#define _DCDC_IEN_EM4ERR_DEFAULT                      0x00000000UL                        /**< Mode DEFAULT for DCDC_IEN                   */
#define DCDC_IEN_EM4ERR_DEFAULT                       (_DCDC_IEN_EM4ERR_DEFAULT << 7)     /**< Shifted mode DEFAULT for DCDC_IEN           */

/* Bit fields for DCDC STATUS */
#define _DCDC_STATUS_RESETVALUE                       0x00000000UL                          /**< Default value for DCDC_STATUS               */
#define _DCDC_STATUS_MASK                             0x0000001FUL                          /**< Mask for DCDC_STATUS                        */
#define DCDC_STATUS_BYPSW                             (0x1UL << 0)                          /**< Bypass Switch is currently enabled          */
#define _DCDC_STATUS_BYPSW_SHIFT                      0                                     /**< Shift value for DCDC_BYPSW                  */
#define _DCDC_STATUS_BYPSW_MASK                       0x1UL                                 /**< Bit mask for DCDC_BYPSW                     */
#define _DCDC_STATUS_BYPSW_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for DCDC_STATUS                */
#define DCDC_STATUS_BYPSW_DEFAULT                     (_DCDC_STATUS_BYPSW_DEFAULT << 0)     /**< Shifted mode DEFAULT for DCDC_STATUS        */
#define DCDC_STATUS_WARM                              (0x1UL << 1)                          /**< DCDC Warmup Done                            */
#define _DCDC_STATUS_WARM_SHIFT                       1                                     /**< Shift value for DCDC_WARM                   */
#define _DCDC_STATUS_WARM_MASK                        0x2UL                                 /**< Bit mask for DCDC_WARM                      */
#define _DCDC_STATUS_WARM_DEFAULT                     0x00000000UL                          /**< Mode DEFAULT for DCDC_STATUS                */
#define DCDC_STATUS_WARM_DEFAULT                      (_DCDC_STATUS_WARM_DEFAULT << 1)      /**< Shifted mode DEFAULT for DCDC_STATUS        */
#define DCDC_STATUS_RUNNING                           (0x1UL << 2)                          /**< DCDC is running                             */
#define _DCDC_STATUS_RUNNING_SHIFT                    2                                     /**< Shift value for DCDC_RUNNING                */
#define _DCDC_STATUS_RUNNING_MASK                     0x4UL                                 /**< Bit mask for DCDC_RUNNING                   */
#define _DCDC_STATUS_RUNNING_DEFAULT                  0x00000000UL                          /**< Mode DEFAULT for DCDC_STATUS                */
#define DCDC_STATUS_RUNNING_DEFAULT                   (_DCDC_STATUS_RUNNING_DEFAULT << 2)   /**< Shifted mode DEFAULT for DCDC_STATUS        */
#define DCDC_STATUS_VREGIN                            (0x1UL << 3)                          /**< VREGVDD comparator status                   */
#define _DCDC_STATUS_VREGIN_SHIFT                     3                                     /**< Shift value for DCDC_VREGIN                 */
#define _DCDC_STATUS_VREGIN_MASK                      0x8UL                                 /**< Bit mask for DCDC_VREGIN                    */
#define _DCDC_STATUS_VREGIN_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for DCDC_STATUS                */
#define DCDC_STATUS_VREGIN_DEFAULT                    (_DCDC_STATUS_VREGIN_DEFAULT << 3)    /**< Shifted mode DEFAULT for DCDC_STATUS        */
#define DCDC_STATUS_BYPCMPOUT                         (0x1UL << 4)                          /**< Bypass Comparator Output                    */
#define _DCDC_STATUS_BYPCMPOUT_SHIFT                  4                                     /**< Shift value for DCDC_BYPCMPOUT              */
#define _DCDC_STATUS_BYPCMPOUT_MASK                   0x10UL                                /**< Bit mask for DCDC_BYPCMPOUT                 */
#define _DCDC_STATUS_BYPCMPOUT_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for DCDC_STATUS                */
#define DCDC_STATUS_BYPCMPOUT_DEFAULT                 (_DCDC_STATUS_BYPCMPOUT_DEFAULT << 4) /**< Shifted mode DEFAULT for DCDC_STATUS        */

/* Bit fields for DCDC SYNCBUSY */
#define _DCDC_SYNCBUSY_RESETVALUE                     0x00000000UL                           /**< Default value for DCDC_SYNCBUSY             */
#define _DCDC_SYNCBUSY_MASK                           0x00000001UL                           /**< Mask for DCDC_SYNCBUSY                      */
#define DCDC_SYNCBUSY_SYNCBUSY                        (0x1UL << 0)                           /**< Combined Sync Busy Status                   */
#define _DCDC_SYNCBUSY_SYNCBUSY_SHIFT                 0                                      /**< Shift value for DCDC_SYNCBUSY               */
#define _DCDC_SYNCBUSY_SYNCBUSY_MASK                  0x1UL                                  /**< Bit mask for DCDC_SYNCBUSY                  */
#define _DCDC_SYNCBUSY_SYNCBUSY_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for DCDC_SYNCBUSY              */
#define DCDC_SYNCBUSY_SYNCBUSY_DEFAULT                (_DCDC_SYNCBUSY_SYNCBUSY_DEFAULT << 0) /**< Shifted mode DEFAULT for DCDC_SYNCBUSY      */

/* Bit fields for DCDC CCCTRL */
#define _DCDC_CCCTRL_RESETVALUE                       0x00000000UL                      /**< Default value for DCDC_CCCTRL               */
#define _DCDC_CCCTRL_MASK                             0x00000001UL                      /**< Mask for DCDC_CCCTRL                        */
#define DCDC_CCCTRL_CCEN                              (0x1UL << 0)                      /**< Coulomb Counter Enable                      */
#define _DCDC_CCCTRL_CCEN_SHIFT                       0                                 /**< Shift value for DCDC_CCEN                   */
#define _DCDC_CCCTRL_CCEN_MASK                        0x1UL                             /**< Bit mask for DCDC_CCEN                      */
#define _DCDC_CCCTRL_CCEN_DEFAULT                     0x00000000UL                      /**< Mode DEFAULT for DCDC_CCCTRL                */
#define DCDC_CCCTRL_CCEN_DEFAULT                      (_DCDC_CCCTRL_CCEN_DEFAULT << 0)  /**< Shifted mode DEFAULT for DCDC_CCCTRL        */

/* Bit fields for DCDC CCCALCTRL */
#define _DCDC_CCCALCTRL_RESETVALUE                    0x00000000UL                             /**< Default value for DCDC_CCCALCTRL            */
#define _DCDC_CCCALCTRL_MASK                          0x0000030FUL                             /**< Mask for DCDC_CCCALCTRL                     */
#define DCDC_CCCALCTRL_CCLOADEN                       (0x1UL << 0)                             /**< CC Load Circuit Enable                      */
#define _DCDC_CCCALCTRL_CCLOADEN_SHIFT                0                                        /**< Shift value for DCDC_CCLOADEN               */
#define _DCDC_CCCALCTRL_CCLOADEN_MASK                 0x1UL                                    /**< Bit mask for DCDC_CCLOADEN                  */
#define _DCDC_CCCALCTRL_CCLOADEN_DEFAULT              0x00000000UL                             /**< Mode DEFAULT for DCDC_CCCALCTRL             */
#define DCDC_CCCALCTRL_CCLOADEN_DEFAULT               (_DCDC_CCCALCTRL_CCLOADEN_DEFAULT << 0)  /**< Shifted mode DEFAULT for DCDC_CCCALCTRL     */
#define _DCDC_CCCALCTRL_CCLVL_SHIFT                   1                                        /**< Shift value for DCDC_CCLVL                  */
#define _DCDC_CCCALCTRL_CCLVL_MASK                    0xEUL                                    /**< Bit mask for DCDC_CCLVL                     */
#define _DCDC_CCCALCTRL_CCLVL_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for DCDC_CCCALCTRL             */
#define _DCDC_CCCALCTRL_CCLVL_LOAD0                   0x00000000UL                             /**< Mode LOAD0 for DCDC_CCCALCTRL               */
#define _DCDC_CCCALCTRL_CCLVL_LOAD1                   0x00000001UL                             /**< Mode LOAD1 for DCDC_CCCALCTRL               */
#define _DCDC_CCCALCTRL_CCLVL_LOAD2                   0x00000002UL                             /**< Mode LOAD2 for DCDC_CCCALCTRL               */
#define _DCDC_CCCALCTRL_CCLVL_LOAD3                   0x00000003UL                             /**< Mode LOAD3 for DCDC_CCCALCTRL               */
#define _DCDC_CCCALCTRL_CCLVL_LOAD4                   0x00000004UL                             /**< Mode LOAD4 for DCDC_CCCALCTRL               */
#define _DCDC_CCCALCTRL_CCLVL_LOAD5                   0x00000005UL                             /**< Mode LOAD5 for DCDC_CCCALCTRL               */
#define _DCDC_CCCALCTRL_CCLVL_LOAD6                   0x00000006UL                             /**< Mode LOAD6 for DCDC_CCCALCTRL               */
#define _DCDC_CCCALCTRL_CCLVL_LOAD7                   0x00000007UL                             /**< Mode LOAD7 for DCDC_CCCALCTRL               */
#define DCDC_CCCALCTRL_CCLVL_DEFAULT                  (_DCDC_CCCALCTRL_CCLVL_DEFAULT << 1)     /**< Shifted mode DEFAULT for DCDC_CCCALCTRL     */
#define DCDC_CCCALCTRL_CCLVL_LOAD0                    (_DCDC_CCCALCTRL_CCLVL_LOAD0 << 1)       /**< Shifted mode LOAD0 for DCDC_CCCALCTRL       */
#define DCDC_CCCALCTRL_CCLVL_LOAD1                    (_DCDC_CCCALCTRL_CCLVL_LOAD1 << 1)       /**< Shifted mode LOAD1 for DCDC_CCCALCTRL       */
#define DCDC_CCCALCTRL_CCLVL_LOAD2                    (_DCDC_CCCALCTRL_CCLVL_LOAD2 << 1)       /**< Shifted mode LOAD2 for DCDC_CCCALCTRL       */
#define DCDC_CCCALCTRL_CCLVL_LOAD3                    (_DCDC_CCCALCTRL_CCLVL_LOAD3 << 1)       /**< Shifted mode LOAD3 for DCDC_CCCALCTRL       */
#define DCDC_CCCALCTRL_CCLVL_LOAD4                    (_DCDC_CCCALCTRL_CCLVL_LOAD4 << 1)       /**< Shifted mode LOAD4 for DCDC_CCCALCTRL       */
#define DCDC_CCCALCTRL_CCLVL_LOAD5                    (_DCDC_CCCALCTRL_CCLVL_LOAD5 << 1)       /**< Shifted mode LOAD5 for DCDC_CCCALCTRL       */
#define DCDC_CCCALCTRL_CCLVL_LOAD6                    (_DCDC_CCCALCTRL_CCLVL_LOAD6 << 1)       /**< Shifted mode LOAD6 for DCDC_CCCALCTRL       */
#define DCDC_CCCALCTRL_CCLVL_LOAD7                    (_DCDC_CCCALCTRL_CCLVL_LOAD7 << 1)       /**< Shifted mode LOAD7 for DCDC_CCCALCTRL       */
#define DCDC_CCCALCTRL_CCCALEM2                       (0x1UL << 8)                             /**< CC Calibrate EM2                            */
#define _DCDC_CCCALCTRL_CCCALEM2_SHIFT                8                                        /**< Shift value for DCDC_CCCALEM2               */
#define _DCDC_CCCALCTRL_CCCALEM2_MASK                 0x100UL                                  /**< Bit mask for DCDC_CCCALEM2                  */
#define _DCDC_CCCALCTRL_CCCALEM2_DEFAULT              0x00000000UL                             /**< Mode DEFAULT for DCDC_CCCALCTRL             */
#define DCDC_CCCALCTRL_CCCALEM2_DEFAULT               (_DCDC_CCCALCTRL_CCCALEM2_DEFAULT << 8)  /**< Shifted mode DEFAULT for DCDC_CCCALCTRL     */
#define DCDC_CCCALCTRL_CCCALHALT                      (0x1UL << 9)                             /**< CC Calibration Halt Req                     */
#define _DCDC_CCCALCTRL_CCCALHALT_SHIFT               9                                        /**< Shift value for DCDC_CCCALHALT              */
#define _DCDC_CCCALCTRL_CCCALHALT_MASK                0x200UL                                  /**< Bit mask for DCDC_CCCALHALT                 */
#define _DCDC_CCCALCTRL_CCCALHALT_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for DCDC_CCCALCTRL             */
#define DCDC_CCCALCTRL_CCCALHALT_DEFAULT              (_DCDC_CCCALCTRL_CCCALHALT_DEFAULT << 9) /**< Shifted mode DEFAULT for DCDC_CCCALCTRL     */

